Repository: bertelsmannstift/Chancenportal
Catalog: web/typo3conf/l10n/*/realurl/Resources/Private/Language/*.locallang.xlf
Languages: de

# mlang_tabs_tab
source: Speaking URLs
de: Sprechende URLs

# mlang_labels_tablabel
source: Speaking URL management
de: RealURL-Verwaltung

# mlang_labels_tabdescr
source: Management for speaking URLs in TYPO3 CMS
de: Verwaltung für sprechende URLs in TYPO3 CMS

# module.index
source: Overview
de: Überblick

# module.index.intro_functions
source: This is a RealURL administration module. It provides functions that you can select from the selector at the top. Here is the overview of the provided functions.
de: Das ist ein RealURL-Verwaltungsmodul. Es stellt Funktionen zur Verfügung, die Sie aus dem Auswahlfeld oben auswählen können. Hier ist die Übersicht der verfügbaren Funktionen.

# module.aliases
source: Aliases
de: Aliasse

# module.aliases.intro
source: This module manages aliases that are created for items like news or addresses or any other custom types of data.
de: Dieses Modul verwaltet Aliasse, die für Elemente wie Nachrichten oder Adressen oder andere, benutzerdefinierte Typen von Daten erstellt worden sind.

# module.aliases.not_available
source: Currently there are no aliases available.
de: Im Moment sind keine Aliasse verfügbar.

# module.aliases.not_found
source: The sellected alias is no longer available.
de: Der ausgewählte Alias ist nicht mehr verfügbar.

# module.aliases.available
source: Available aliases
de: Verfügbare Aliasse

# module.aliases.available.select
source: Select alias type:
de: Wählen Sie einen Typ von Alias:

# module.aliases.deleted
source: The alias was deleted.
de: Der Alias wurde gelöscht.

# module.aliases.all_deleted
source: Aliases were deleted.
de: Die Aliasse wurden gelöscht.

# module.aliases.edit.submit
source: Save
de: Speichern

# module.aliases.edit.back
source: Cancel
de: Abbrechen

# module.aliases.edit.alias_value
source: Alias value:
de: Aliaswert:

# module.aliases.edit.alias_info.tablename
source: Table name:
de: Tabellenname:

# module.aliases.edit.alias_info.uid
source: Record uid:
de: Datensatz-UID:

# module.aliases.edit.alias_info.field_value
source: Field value:
de: Feldwert:

# module.aliases.edit.saved
source: Alias successfully updated.
de: Alias erfolgreich aktualisiert.

# module.aliases.edit.error.already_exists
source: Such alias already exists for another record in this language.
de: Ein derartiger Alias existiert bereits für einen anderen Datensatz in dieser Sprache.

# module.aliases.edit.error.bad_alias_value
source: Alias value may only contain the following characters: %s
de: Der Aliaswert darf nur die folgenden Zeichen enthalten: %s

# module.aliases.search.for
source: Search alias value for:
de: Aliaswert suchen für:

# module.aliases.search.submit
source: Submit
de: Absenden

# module.aliases.search.reset
source: Reset
de: Zurücksetzen

# module.url_cache
source: URL Data
de: URL-Daten

# module.url_cache.intro
source: This module allows you to view and remove URLs for pages. URL data contains complete URLs consisting from page path and any encoded parameters. Note that it is <strong>extremely dangerous</strong> to manipulate these entries manually! Your installation can be broken if you do so.
de: Dieses Modul erlaubt es, URLs zu suchen und zu entfernen. Die URL-Daten enthalten vollständige URLs bestehend aus Seitenpfad und jeglichen kodierten Parametern. Beachten Sie, dass es <strong>sehr</strong> gefährlich ist, diese Einträge manuell zu bearbeiten! Sie können dadurch Ihre Installation beschädigen.

# module.path_cache
source: Path Data
de: Pfaddaten

# module.path_cache.intro
source: This module allows you to view and remove page path data. Note that it is <strong>extremely dangerous</strong> to manipulate these entries manually! Your installation can be broken if you do so.
de: Dieses Modul erlaubt es, Pfaddaten für Seiten zu suchen und zu entfernen. Beachten Sie, dass es <strong>sehr</strong> gefährlich ist, diese Einträge manuell zu bearbeiten! Sie können dadurch Ihre Installation beschädigen.

# module.configuration
source: Configuration
de: Konfiguration

# module.configuration.intro
source: This module will show you RealURL configuration as RealURL will see it (including default values).</p><p><strong>Note:</strong> your TYPO3 solution provider may use its own ways to configure RealURL at runtime. If that's the case, this module may not show confguration accurately. If you suspect that this is the case, contact your TYPO3 solution provider.
de: Dieses Modul zeigt die RealURL-Konfiguration, wie RealURL sie sieht (inklusive Standardwerten).</p><p><strong>Hinweis:</strong> Ihr Anbieter von TYPO3-Lösungen benutzt möglicherweise eigene Wege, um RealURL während der Laufzeit zu konfigurieren. In diesem Fall mag dieses Modul die Konfiguration nicht akkurat anzeigen. Wenn Sie vermuten, dass dies der Fall ist, kontaktieren Sie Ihren Anbieter von TYPO3-Lösungen.

# module.tableHeader.language
source: Language
de: Sprache

# module.tableHeader.expire
source: Expires
de: Läuft ab

# viewhelper.languageFromId.defaultLanguage
source: Default
de: Standard

# module.deleteAliasesOfType
source: Delete all aliases of this type
de: Alle Aliasse dieses Typs löschen

# module.js.deleteSingleAlias
source: Do you want to delete this alias?
de: Diesen Alias tatsächlich löschen?

# module.js.yes
source: Yes
de: Ja

# module.js.no
source: No
de: Nein

# module.js.confirmTitle
source: Confirm
de: Bestätigen

# module.js.deleteAliases
source: Do you want to delete all aliases of this type?
de: Tatsächlich alle Aliasse dieses Typs löschen?

# module.tableHeader.speaking_url
source: Speaking URL
de: Sprechende URL

# module.tableHeader.rootpage_id
source: Root page id
de: ID der Wurzelseite

# module.tableHeader.page_path
source: Page path
de: Seitenpfad

# module.tableHeader.mp_var
source: Mount point
de: Freigabepunkt

# module.js.deleteSingleCacheEntry
source: Do you want to delete this entry? This can be harmful for your installation!
de: Diesen Eintrag tatsächlich löschen? Dies kann Ihrer Installation schaden!

# module.js.deleteCacheEntries
source: Do you want to delete all entries for this page? This can be harmful for your installation!
de: Tatsächlich alle Einträge für diese Seite löschen? Dies kann Ihrer Installation schaden!

# module.deleteCacheEntriesForPage
source: Delete all entries for this page (harmful!)
de: Alle Einträge dieser Seite löschen (schädlich!)

# module.flushCache
source: Flush all entries (harmful!)
de: Alle Einträge löschen (schädlich!)

# module.js.flushCache
source: Do you want to remove all entries? This WILL cause performance issues with the web site and can make some pages inaccessible!
de: Tatsächlich alle Einträge entfernen? Dies WIRD die Performance Ihrer Website negativ beeinflussen und kann Seiten unzugänglich machen!

# module.url_cache.entry_deleted
source: Entry was removed.
de: Eintrag wurde entfernt.

# module.url_cache.all_entries_deleted
source: All entries for this page were removed.
de: Alle Einträge für diese Seite wurden entfernt.

# module.url_cache.flushed
source: All cache entries were removed.
de: Alle Cacheeinträge wurden entfernt.

# module.path_cache.entry_deleted
source: Entry was removed.
de: Eintrag wurde entfernt.

# module.url_cache.duplicate_url
source: URL conflict detected: '%s' is also used on page(s): %s
de: URL-Konflikt festgestellt: '%s' wird ebenfalls auf der folgenden oder den folgenden Seiten benutzt: %s

# module.path_cache.duplicate_path
source: Path conflict detected: '%s' is also used on page(s): %s
de: Pfad-Konflikt festgestellt: '%s' wird ebenfalls auf der folgenden oder den folgenden Seiten benutzt: %s
