Repository: bertelsmannstift/Chancenportal
Catalog: web/typo3conf/l10n/*/flux/Resources/Private/Language/*.locallang.xlf
Languages: de

# newContentWizard.fluxContent
source: Flux content
de: Flux-Inhalt

# tt_content.tx_flux_container
source: Content Container
de: Inhalts-Container

# tt_content.tx_flux_parent
source: Parent element
de: Eltern-Element

# tt_content.tx_flux_column
source: Content area of parent
de: Inhaltsbereich des Eltern-Elements

# tt_content.tx_flux_children
source: Child content
de: Unterelement

# tt_content.tabs.relation
source: Relations
de: Relationen

# tt_content.tx_flux_options
source: Options
de: Option(en)

# flux.clearValue
source: Clear value
de: Wert leeren

# pipes.standard.label
source: Standard pipe (no action)
de: Standard-Pipe (keine Aktion)

# pipes.email.label
source: Email sending pipe
de: E-Mail-Versand-Pipe

# pipes.flashMessage.label
source: FlashMessage dispatch pipe
de: FlashMessage-Weiterleitungs-Pipe

# reference
source: Reference to content on page '%s' - click to jump to original
de: Referenz auf den Inhalt von Seite '%s' - Anklicken um zum Original zu springen.

# user.no_fields
source: No fields found in form
de: Keine Felder im Formular gefunden

# user.no_selection
source: No form selected/configured (enabling Flux debug will produce more information)
de: Kein Formular ausgewählt/konfiguriert (Mehr Informationen mit aktiviertem Flux-Debug)

# user.no_template
source: No FlexForm source selected. This is usually caused by incorrect template paths being returned by a ConfigurationProvider - in the case of FED/FluidContent/FluidPages this can also be caused by not having selected a page template or Fluid content element type, which can be considered a safe "error" that is only reported because debug mode is enabled in Flux. The parameters which lead to this error were:
de: Keine FlexForm-Quelle ausgewählt. Grund sind üblicherweise nicht-korrekte Template-Pfade aus einem ConfigurationProvider. Im Fall von FED/FluidContent/FluidPages kann dies auch hervorgerufen werden wenn kein Seitenmplate oder Fluid-Content Elementen-Typ ausgewählt wurde. Die kann sicher als sicherer "Fehler" betrachtet werden, da er nur bei aktiviertem Debug-Mode in Flux ausgegeben wird. Folgender Parameter führte zu diesem Fehler:

# new
source: Insert new content element in this position
de: Neues Inhaltselement an dieser Stelle einfügen

# paste
source: Paste in this position
de: An dieser Stelle einfügen

# paste_reference
source: Paste as reference in this position
de: An dieser Stelle als Referenz einfügen
