Repository: bertelsmannstift/Chancenportal
Catalog: packages/ui_forms/Resources/Private/Language/*.locallang.xlf
Languages: de

# element.ImageUpload.properties.SummaryPage.altText
source: uploaded image
de: Hochgeladenes Bild

# element.DatePicker.properties.timeSelectorHourLabel
source: Hour
de: Stunde

# validation.error.1221560910
source: This field is mandatory
de: Dieses Feld ist ein Pflichtfeld

# validation.error.1221560718
source: This field is mandatory
de: Dieses Feld ist ein Pflichtfeld

# validation.error.1347992400
source: This field is mandatory
de: Dieses Feld ist ein Pflichtfeld

# validation.error.1347992453
source: This field is mandatory
de: Dieses Feld ist ein Pflichtfeld

# validation.error.1238087674
source: Please enter a valid Date
de: Bitte geben Sie ein gültiges Datum ein

# validation.error.1221551320
source: Please enter letters or digits
de: Bitte geben Sie Buchstaben oder Zahlen ein

# validation.error.1221565786
source: Please enter a valid text (e.g. without XML tags)
de: Bitte geben Sie einen gültigen Text ein (z.B. ohne XML Tags)

# validation.error.1238110957
source: Please enter a valid text
de: Bitte geben Sie einen gültigen Text ein

# validation.error.1269883975
source: Please enter a valid text
de: Bitte geben Sie einen gültigen Text ein

# validation.error.1428504122
source: Please enter a text between %s and %s characters
de: Bitte geben Sie einen Text mit %s bis %s Zeichen ein

# validation.error.1238108068
source: Please enter a text which is longer than %s characters
de: Bitte geben Sie einen Text ein, der länger als %s Zeichen ist

# validation.error.1238108069
source: Please enter a text which is not longer than %s characters
de: Bitte geben Sie einen Text ein, der nicht länger als %s Zeichen ist

# validation.error.1221559976
source: Please enter a valid email address
de: Bitte geben Sie eine korrekte E-Mail-Adresse an

# validation.error.1221560494
source: Please enter a valid number
de: Bitte geben Sie eine gültige Zahl ein

# validation.error.1221560288
source: Please enter a valid floating point number
de: Bitte geben Sie eine gültige Fließkommazahl ein

# validation.error.1221563685
source: Please enter a valid number
de: Bitte geben Sie eine gültige Zahl ein

# validation.error.1221561046
source: Please enter a valid number between %s and %s
de: Bitte geben Sie eine gültige Zahl zwischen %s und %s ein

# validation.error.1221565130
source: Please enter a valid value
de: Bitte geben Sie einen gültigen Wert ein

# validation.error.1475002976
source: The given subject is not countable.
de: Der eingegebene Wert ist nicht zählbar

# validation.error.1475002994
source: Please select %s to %s elements.
de: Bitte wählen Sie %s bis %s Elements aus

# validation.error.1471708998
source: The media type "%s" is not allowed for this file.
de: Der Typ "%s" ist nicht erlaubt

# validation.error.1476396435
source: Do not fill this field
de: Füllen Sie dieses Feld bitte nicht aus

# element.FileUpload.properties.uploadLabel
source: Select file
de: Datei wählen

# element.ImageUpload.properties.uploadLabel
source: Select file
de: Datei wählen

# form.validation.error.general
source: The form could not be sent. Please check your input and try again.
de: Das Formular konnte leider nicht versendet werden. Bitte prüfen Sie die Eingaben und versuchen Sie es erneut.
