Repository: bertelsmannstift/Chancenportal
Catalog: web/typo3conf/l10n/*/saltedpasswords/Resources/Private/Language/*.locallang.xlf
Languages: de

# ext.saltedpasswords.configuration.header.additionalInformation
source: Additional information
de: Zusätzliche Informationen

# ext.saltedpasswords.configuration.header.errorsFound
source: Errors found in your configuration
de: Fehler in Ihrer Konfiguration

# ext.saltedpasswords.configuration.header.noErrorsFound
source: No errors were found
de: Keine Fehler gefunden

# ext.saltedpasswords.configuration.header.warningsFound
source: Warnings about your configuration
de: Warnungen zu Ihrer Konfiguration

# ext.saltedpasswords.configuration.label.important
source: IMPORTANT:
de: WICHTIG:

# ext.saltedpasswords.configuration.label.warning
source: WARNING:
de: WARNUNG:

# ext.saltedpasswords.configuration.message.backendRsa
source: The backend is configured to use SaltedPasswords with RSA authentication.
de: Das Backend ist so konfiguriert, dass SaltedPasswords mit RSA-Authentifizierung genutzt wird.

# ext.saltedpasswords.configuration.message.backendSecurityLevelNotRsa
source: The "rsaauth" extension is installed, but TYPO3 is not configured to use it during login. Use the Install Tool to set the Login Security Level for the backend to "rsa" ($TYPO3_CONF_VARS['BE']['loginSecurityLevel'])
de: Die rsaauth-Erweiterung ist installiert, aber TYPO3 ist nicht so konfiguriert, dass sie bei der Anmeldung genutzt wird. Benutzen Sie das Install-Tool, um das Anmeldungssicherheitslevel für das Backend auf "rsa" zu stellen ($TYPO3_CONF_VARS['BE']['loginSecurityLevel']).

# ext.saltedpasswords.configuration.message.backendSsl
source: The backend is configured to use SaltedPasswords over SSL.
de: Das Backend ist so konfiguriert, dass SaltedPasswords über SSL genutzt wird.

# ext.saltedpasswords.configuration.message.errorForceSaltedAndUpdatePassword
source: SaltedPasswords is configured wrong and will not work as expected: It is not possible to set "updatePasswd" and "forceSalted" at the same time. Please disable either one of them.
de: SaltedPasswords ist falsch konfiguriert und wird nicht wie erwartet funktionieren: Es ist nicht möglich, "updatePasswd" und "forceSalted" zur selben Zeit zu setzen. Bitte deaktivieren Sie eines von beiden.

# ext.saltedpasswords.configuration.message.errorHashMethodNotAvailable
source: The selected method for hashing your salted passwords is not available on this system! Please check your configuration.
de: Die für SaltedPasswords ausgewählte Hash-Methode ist auf diesem System nicht verfügbar! Bitte überprüfen Sie Ihre Konfiguration.

# ext.saltedpasswords.configuration.message.errorsFound
source: SaltedPasswords will not work until these problems have been resolved:
de: SaltedPasswords wird nicht funktionieren bis die folgenden Probleme gelöst sind:

# ext.saltedpasswords.configuration.message.infoForceSalted
source: SaltedPasswords has been configured to enforce salted passwords (forceSalted). This means that only passwords in the format of this extension will succeed for login.
de: SaltedPasswords ist konfiguriert, gesalzene Passworte zu erzwingen (forceSalted). Das bedeutet, dass die Anmeldung ausschließlich mit Passworten im Format dieser Erweiterung gelingen wird.

# ext.saltedpasswords.configuration.message.infoLoginSecurityLevelDifferent
source: Frontend requirements for SaltedPasswords are not met, therefore the authentication will not work even if it was explicitly enabled for frontend usage:
de: Frontendanforderungen für SaltedPasswords sind nicht erfüllt; die Authentifizierung wird daher nicht funktionieren, selbst wenn sie für das Frontend explizit aktiviert wurde:

source: Install the "rsaauth" extension and use the Install Tool to set the Login Security Level for the frontend to "rsa" ($TYPO3_CONF_VARS['FE']['loginSecurityLevel'])
de: Installieren Sie die rsaauth-Erweiterung und benutzen Sie das Install-Tool, um das Anmeldungssicherheitslevel für das Frontend auf "rsa" zu stellen ($TYPO3_CONF_VARS['FE']['loginSecurityLevel']).

# ext.saltedpasswords.configuration.message.infoLoginSecurityLevelDifferentNote
source: Make sure that the Login Security Level is not set to "" or "challenged"!
de: Stellen Sie sicher, dass das Anmeldungssicherheitslevel auf "" oder "challenged" gestellt ist!

source: Alternatively, use the Install Tool to set the Login Security Level for the frontend to "normal" ($TYPO3_CONF_VARS['FE']['loginSecurityLevel'])
de: Alternativ können Sie das Install-Tool benutzen, um das Anmeldungssicherheitslevel für das Frontend auf "normal" zu stellen ($TYPO3_CONF_VARS['FE']['loginSecurityLevel']).

# ext.saltedpasswords.configuration.message.infoOnlyBackendAuthService
source: SaltedPasswords has been configured to be the only authentication service for the backend. This means that other services like "ipauth", "openid", etc. will be ignored (except "rsauth", which is implicitely used).
de: SaltedPasswords ist als einziger Authentifizierungsdienst für das Backend konfiguriert. Das bedeutet, dass andere Dienste wie "ipauth", "openid" usw. ignoriert werden (ausgenommen "rsaauth", das implizit benutzt wird).

# ext.saltedpasswords.configuration.message.infoOnlyFrontendAuthService
source: SaltedPasswords has been configured to be the only authentication service for frontend logins. This means that other services like "ipauth", "openid", etc. will be ignored.
de: SaltedPasswords ist als einziger Authentifizierungsdienst für Frontendanmeldungen konfiguriert. Das bedeutet, dass andere Dienste wie "ipauth", "openid" usw. ignoriert werden.

# ext.saltedpasswords.configuration.message.infoSaltedpasswordsFrontendDisabled
source: SaltedPasswords has been disabled for frontend users.
de: SaltedPasswords ist für Frontend-Benutzer deaktiviert worden.

# ext.saltedpasswords.configuration.message.noErrorsFound
source: SaltedPasswords has been configured correctly and works as expected.
de: SaltedPasswords ist richtig konfiguriert und funktioniert wie erwartet.

# ext.saltedpasswords.configuration.message.okFeRsaauthLoaded
source: The frontend is configured to use SaltedPasswords with RSA authentication.
de: Das Frontend ist so konfiguriert, dass SaltedPasswords mit RSA-Authentifizierung genutzt wird.

# ext.saltedpasswords.configuration.message.openSslMissing
source: Using the extension "rsaauth" is not possible, as no encryption backend is available. Please install and configure the PHP extension "openssl". See
de: Die Erweiterung "rsaauth" kann nicht benutzt werden, weil kein Verschlüsselungsbackend verfügbar ist. Bitte installieren und konfigurieren Sie die PHP-Erweiterung "openssl". Siehe

# ext.saltedpasswords.configuration.message.rsaInstructionsFirstItem
source: Install the "rsaauth" extension and use the Install Tool to set the Login Security Level for the backend to "rsa" ($TYPO3_CONF_VARS['BE']['loginSecurityLevel'])
de: Installieren Sie die Erweiterung "rsaauth" und benutzen Sie das Install-Tool, um das Anmeldungssicherheitslevel für das Backend ($TYPO3_CONF_VARS['BE']['loginSecurityLevel']) auf "rsa" zu setzen.

# ext.saltedpasswords.configuration.message.rsaInstructionsFootnote
source: It is also possible to use "lockSSL" and "rsa" Login Security Level at the same time.
de: Außerdem ist es möglich, "lockSSL" und das "rsa"-Anmeldungssicherheitslevel zur selben Zeit zu nutzen.

# ext.saltedpasswords.configuration.message.rsaInstructionsIntro
source: SaltedPasswords is used without any transfer encryption, this means your passwords are sent in plain text. Please install rsaauth to secure your passwords submits.
de: SaltedPasswords wird ohne Übertragungsverschlüsselung benutzt, was bedeutet, dass Passworte im Klartext übertragen werden. Bitte installieren Sie rsaauth, um Passwortübertragungen abzusichern.

# ext.saltedpasswords.configuration.message.rsaInstructionsSecondItem
source: If you have the option to use SSL, you can also configure your backend for SSL usage: Use the Install Tool to set the Security-Level for the backend to "normal" ($TYPO3_CONF_VARS['BE']['loginSecurityLevel']) and the SSL-locking option to a value greater than "0" (see description - $TYPO3_CONF_VARS['BE']['lockSSL'])
de: Wenn Sie die Möglichkeit haben, SSL zu nutzen, können Sie das Backend entsprechend konfigurieren: Benutzen Sie das Install-Tool, um das Sicherheitslevel für das Backend ($TYPO3_CONF_VARS['BE']['loginSecurityLevel']) auf "normal" zu stellen. Setzen Sie außerdem die SSL-Einschränkungsoption auf einen Wert größer "0" (siehe Beschreibung - $TYPO3_CONF_VARS['BE']['lockSSL']).

# ext.saltedpasswords.configuration.message.securityWarning
source: Note, that a wrong configuration might have impact on the security of your TYPO3 installation and the usability of the backend.
de: Beachten Sie, dass eine falsche Konfiguration Einfluss auf die Sicherheit Ihrer TYPO3-Installation und auf die Benutzbarkeit des Backends haben kann.

# ext.saltedpasswords.configuration.message.warningForceSalted
source: SaltedPasswords has been configured to be the only authentication service for the backend. Additionally, usage of salted passwords is enforced (forceSalted). The result is that there is no chance to login with users not having a salted password hash.
de: SaltedPasswords ist als einziger Authentifizierungsdienst für das Backend konfiguriert. Zusätzlich ist es so konfiguriert, dass gesalzene Passworte erzwungen werden (forceSalted). Das bedeutet, dass Benutzer, die kein gesalzenes Passwort verwenden, sich nicht mehr anmelden können.

# ext.saltedpasswords.configuration.message.warningForceSaltedNote2
source: This has the effect that passwords that were set before SaltedPasswords was used will not work (in fact, they need to be redefined).
de: Das bedeutet, dass Passworte, die gesetzt worden sind, bevor SaltedPasswords benutzt wurde, nicht funktionieren werden (vielmehr müssen Sie neugesetzt werden).

# ext.saltedpasswords.configuration.message.warningForceSaltedNoteForBackend
source: This may lock you out of the backend!
de: Dies sperrt Sie möglicherweise aus dem Backend aus!

# ext.saltedpasswords.configuration.message.warningForceSaltedNoteForFrontend
source: Because of this, it is not possible to login with users not having a salted password hash (e.g. existing frontend users).
de: Deshalb können Benutzer ohne gesalzenes Passwort (z.B. bestehende Frontend-Benutzer) sich nicht anmelden.

source: The "rsaauth" extension is not installed, but TYPO3 CMS is configured to use it. Either install the extension or adapt the configuration by setting [FE][loginSecurityLevel] to "normal" in the Install Tool.
de: Die rsaauth-Erweiterung ist nicht installiert, aber TYPO3 CMS ist so konfiguriert, dass es sie nutzen sollte. Installieren Sie entweder die Erweiterung oder passen Sie die Konfiguration an, indem Sie [FE][loginSecurityLevel] im Install-Tool auf "normal" stellen.

# ext.saltedpasswords.configuration.message.warningsFound
source: SaltedPasswords might behave different than expected:
de: SaltedPasswords verhält sich möglicherweise anders als erwartet:

# ext.saltedpasswords.tasks.bulkupdate.description
source: Update all frontend and backend user passwords to salted hashes. This task deactivates itself when completed.
de: Alle Frontend- und Backend-Benutzerpasswörter zu saltedpasswords aktualisieren. Dieser Task deaktiviert sich nach Beendigung selbst.

# ext.saltedpasswords.tasks.bulkupdate.invalidNumberOfRecords
source: The number of records to process on each run must be greater than zero and numeric.
de: Die Anzahl zu bearbeitender Datensätze pro Durchlauf muss größer Null und numerisch sein.

# ext.saltedpasswords.tasks.bulkupdate.label.additionalinformation.deactivateself
source: Deactivate=
de: Deaktivieren=

# ext.saltedpasswords.tasks.bulkupdate.label.additionalinformation.numberofrecords
source: Number of records=
de: Anzahl Datensätze=

# ext.saltedpasswords.tasks.bulkupdate.label.canDeactivateSelf
source: Deactivate if all records are converted
de: Deaktivieren sobald alle Datensätze konvertiert wurden

# ext.saltedpasswords.tasks.bulkupdate.label.numberOfRecords
source: The number of records to process on each run
de: Die Anzahl zu bearbeitender Datensätze pro Durchlauf

# ext.saltedpasswords.tasks.bulkupdate.name
source: Convert user passwords to salted hashes
de: Benutzerpasswörter zu saltedpasswords konvertieren

# ext.saltedpasswords.title.blowfishsalt
source: Blowfish salted hashing (advanced)
de: Blowfish-salted Hashing (erweitert)

# ext.saltedpasswords.title.md5salt
source: MD5 salted hashing (secure)
de: MD5-salted Hashing (sicher)

# ext.saltedpasswords.title.pbkdf2salt
source: PBKDF2 key derivation (advanced)
de: PBKDF2-Schlüsselableitung (fortgeschritten)

# ext.saltedpasswords.title.phpasssalt
source: Portable PHP password hashing (phpass)
de: Portables PHP-Passwort-Hashing (phpass)

# ext.saltedpasswords.title.tx_saltedpasswords_salts_blowfish
source: Blowfish salted hashing (advanced)
de: Blowfish-salted Hashing (erweitert)

# ext.saltedpasswords.title.tx_saltedpasswords_salts_md5
source: MD5 salted hashing (secure)
de: MD5-salted Hashing (sicher)

# ext.saltedpasswords.title.tx_saltedpasswords_salts_phpass
source: Portable PHP password hashing (phpass)
de: Portables PHP-Passwort-Hashing (phpass)
