Repository: bertelsmannstift/Chancenportal
Catalog: web/typo3conf/l10n/*/context_help/Resources/Private/Language/*.locallang_csh_ttcontent.xlf
Languages: de

# bodytext.description
source: Enter the main text.
de: Geben sie den Haupttext ein.

# colPos.description
source: Select the column position of this element. <strong>Notice:</strong> This may affect whether the Content Element is visible depending on your website template.
de: Wählen Sie die Spaltenposition des Elements. <strong>Beachten Sie</strong>, dass damit die Sichtbarkeit des Elements beeinflusst wird.

# colPos.details
source: Many websites only use one column of content. Some templates, however, let you put content in multiple columns using the Column option. <strong>Notice:</strong> Selecting a column other than "Normal" may cause the Content Element to disappear if the website template does not use that column. If your Content Element mysteriously disappears make sure the Column and Language selectors are set correctly.
de: Die meisten Webseiten verwenden nur eine Spalte für Inhalte. Bei manchen Vorlagen können Sie jedoch Inhalte in mehrere Spalten einfügen und mit dieser Option können Sie eine andere Spalte auswählen. <strong>Beachten Sie,</strong> dass die Auswahl einer anderen Spalte als "Normal" das Inhaltselement verschwinden lässt, solange diese Spalte nicht auch in der Vorlage vorgesehen ist. Falls das Inhaltselement 'seltsamerweise' nicht sichtbar ist, überprüfen Sie bitte, ob Spalte und Sprache richtig ausgewählt wurden.

# cols.description
source: Select a fixed number of table columns
de: Wählen Sie eine feste Anzahl an Spalten aus.

# CType.description
source: Select the kind of Page Content this element represents. New options will appear when you save the record.
de: Wählen Sie die Art des Seiteninhalts aus, den dieser Datensatz darstellt. Neue Optionen erscheinen, sobald Sie den Datensatz speichern.

# CType.details
source: The 'Type' of content you select determines which options are available in the editing form so be sure to save the record before making other changes. This is a description of the various types: <strong>Header</strong> This type allows you to insert a standard Content Element header and nothing more. Almost all the other types described below also include the Header and its options. The Header type provides a way to insert a header without any other content. <strong>Text</strong> The Text type allows you to insert regular page content. It is generally used for text only content. <strong>Text & Images</strong> This is the same as the Text type (regular page content) but with the option of attaching images. <strong>Image</strong> The Image type allows you to insert image only page content. <strong>Bullet List</strong> Lets you create a bullet list. Each line in the text field will appear as a single bullet. <strong>Table</strong> Lets you create <em>simple</em> tables. Each line represents a row in the table and vertical bars ('|') separate each column. A popup wizard is also available. <strong>File Links</strong> Allows you to present a list of files for download. Thumbnails can be attached to the list and you can also display the file size. <strong>Form</strong> Lets you create mail forms using a special syntax or a popup wizard. <strong>Search</strong> This inserts a search box and also shows the search results when a search is performed on the page. <strong>Login</strong> Displays a login box for website users. This is only useful if you have already created website users and usergroups. <strong>Menu/Sitemap</strong> Offers a selection of menus and a sitemap you can insert on a page. <strong>Insert records</strong> This acts as placeholder for other records. With this Content Element, you can resuse multiple content elements from other pages. <strong>Insert plugin</strong> This will allows you to insert news, forums, guestbooks, lists of addresses, and other functionality. Plugins are typically provided by TYPO3 extensions. The available fields and required configuration depend on the extension. <strong>Divider</strong> This inserts a simple horizontal rule on a page. <strong>HTML</strong> This is plain HTML content. Anything added in the HTML Code of this Content Element will be displayed directly on the page without any preprocessing.
de: Der "Typ" des Inhalts-Elements, den Sie auswählen, entscheidet darüber, welche Optionen Ihnen im Formular angezeigt werden. Stellen Sie sicher, dass Sie einen Datensatz sichern, nachdem Sie den Typ geändert haben und bevor Sie weitere Änderungen vornehmen. Dies ist eine Beschreibung der verschiedenen Typen: <strong>Überschrift</strong> Dieser Typ erlaubt Ihnen ausschließlich, eine Überschrift einzufügen. Fast alle anderen Typen erlauben es ebenfalls, eine Überschrift mit genau den selben Optionen anzugeben. Der Typ "Überschrift" bietet also die Möglichkeit, eine Überschrift <em>ohne</em> irgendetwas anderes einzufügen. <strong>Text</strong> Der Text Typ ermöglicht die Eingabe von normalen Seiteninhalten. <strong>Text und Bilder</strong> Dies entspricht dem Typ "Text" (normale Seiteninhalte) mit der zusätzlichen Option, Bilder anzuhängen. <strong>Bild</strong> Das gleiche wie "Text und Bilder", aber ohne Textfeld (also nur Bilder). <strong>Aufzählung</strong> Damit können Sie eine Aufzählung erstellen. Jede Zeile des Textfeldes erscheint als ein Punkt in einer Liste. <strong>Tabelle</strong> Bietet die Möglichkeit, <em>einfache</em> Tabellen zu erstellen. Jede Zeile stellt eine Tabellenzeile dar und vertikale Striche ('|') trennen die Spalten. <strong>Dateilinks</strong> Präsentiert eine Liste von Dateien zum Herunterladen. Sie können Vorschausymbole zuordnen und die Dateigröße anzeigen lassen. <strong>Multimedia</strong> Damit können Sie Multimediaelemente einfügen, wie z.B. Sound, Video, Java-Applets und Flash-Animationen. <strong>Formular</strong> Lässt Sie Mail-Formulare erstellen. Für die Erstellung von Formular-Feldern gibt es eine spezielle Syntax (siehe Dokumentation). <strong>Suche</strong> Dies fügt ein Suchfeld ein und zeigt auch das Ergebnis der Suche an, wenn diese Seite als Ziel der Suchergebnisse angegeben wird. <strong>Anmeldeformular</strong> Zeigt eine Anmeldemaske für Website-Benutzer an. Sie müssen mindestens einen Website-Benutzer und eine Benutzergruppe anlegen, damit dieser Typ Sinn hat. <strong>Textbox</strong> Dieser Typ ist vorgesehen für maßgeschneiderte Designs, die typisch einigen Text und ein Bild enthalten. In anderen Worten, dieser Typ ist nicht immer verfügbar. Benutzen Sie diesen Typ also nur, wenn Sie dazu angewiesen werden. Es existieren andere Typen zur Anzeige von Text und Bildern. <strong>Menü/Sitemap</strong> Bietet eine Auswahl von verschiedenen Link-Menüs und eine Sitemap, die Sie auf einer Seite einfügen können. <strong>Datensatz einfügen</strong> Dies ist ein Platzhalter für andere Datensätze. Mit anderen Worten: Mit diesem Element können Sie andere Datensätze von anderen Seiten anhängen und damit in diese Seite integrieren. <strong>Plug-In einfügen</strong> Dies erlaubt es Ihnen, ein Forum, ein Gästebuch, eine Adressliste, einen Einkaufskorb etc. einzubinden. Die verschiedenen Möglichkeiten sind <em>nur</em> dann verfügbar, wenn sie in der Vorlage richtig konfiguriert wurden. Vergewissern Sie sich also, welche Plug-Ins in Ihrer Website verfügbar sind. <strong>Skript</strong> Dies ist reserviert für benutzerdefinierte Zwecke, womit es Ihnen der Vorlagenprogrammierer erlauben kann, spezialisierte Inhalte einzufügen. <strong>Trenner</strong> Damit fügen Sie eine Trennlinie ein. <strong>HTML</strong> Dies ist reiner HTML-Inhalt. Alles, was hier eingegeben wird, wird ohne weitere Verarbeitung auf der Seite angezeigt.

# _CType.seeAlso
source: tt_content:colPos, tt_content:sys_language_uid, About Content Elements | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/
de: tt_content:colPos, tt_content:sys_language_uid, Über Inhaltselemente | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/

# date.description
source: Enter a date to be displayed above the header.
de: Geben Sie ein Datum ein, das oberhalb der Überschrift angezeigt wird.

# .description
source: All visible content on webpages is typically made by "Page Content" records, often referred to as "Content Elements". Content Elements are managed by the "Page" Module which organizes Content Elements in multiple columns and languages.
de: Der sichtbare Inhalt von Websiten setzt sich üblicherweise aus "Seiteninhalt"-Elementen zusammen, oft auch als "Inhaltselemente" bezeichnet. Inhaltselemente werden über das "Seite"-Modul verwaltet, welches Inhaltselemente in mehreren Spalten und Sprachen organisiert.

# .details
source: "Page Content" records are sortable and can be rearranged. The "Language" and "Column" selectors of the "Page Content" records determines when and where they appear. If you do not change the value of the "Language" and "Column" selectors the Content Element will appear in the default configuration.
de: Seiteninhalte sind geordnet und können daher in beliebiger Reihenfolge angeordnet werden. Beachten Sie auch, dass die Auswahlfelder "Spalte" und "Sprache" bestimmen, wo und unter welchen Umständen die Inhalte erscheinen. Wenn Sie diese Werte nicht ändern, können Sie davon ausgehen, dass Ihre Inhalte standardmäßig erscheinen.

# endtime.description
source: Enter the date when the Content Element should expire and disappear from the website.
de: Geben Sie das Datum ein, ab dem das Element nicht mehr auf der Website erscheinen soll.

# fe_group.description
source: If Usergroup Access Rights are set to a usergroup name, only website users who are logged in and members of the selected usergroup will be able to view the Content Element. The special option 'Hide at Login' means the Content Element will <em>not</em> be visible for any website users that are logged in. Likewise "Show at Any Login" will make the Content Element visible for any logged in website user.
de: Wenn die Zugriffs-Berechtigungen für eine Benutzergruppe ausschließlich für die Benutzergruppe gesetzt sind, können nur Benutzer, die Mitglied dieser Gruppe sind, dieses Inhaltselement sehen. Die Zusatzoption 'Verbergen, wenn eingeloggt' bedeutet, dass dieses Inhaltselement für alle eingeloggten Benutzer <em>nicht</em> sichtbar ist. Umgekehrt macht die Option "Für alle Eingeloggten sichtbar" das Inhalts-Element für alle eingeloggten Nutzer sichtbar.

# fe_group.details
source: The 'Hide at Login' option is is useful if you want to present information like "How to Login" that becomes irrelevant when a website user is actually logged in.
de: Die Optionen in diesem Auswahlfeld sind davon abhängig, welche Benutzergruppen erstellt wurden und für Sie verfügbar sind. Wenn Sie hier eine Benutzergruppe auswählen, wird das Element nicht mehr für Anwender sichtbar sein, die nicht angemeldet sind. Nur angemeldete Benutzer, die Mitglied der ausgewählten Gruppe sind, bekommen das Element zu sehen. "Anzeigen, wenn angemeldet" erweitert die Anzeige: solche Inhalte werden nur angemeldeten Benutzern gezeigt, aber unabhängig davon, welcher Gruppe sie angehören. "Nach Anmeldung verbergen" bewirkt das genaue Gegenteil, d.h. das Element <em>verschwindet</em>, wenn <em>irgendein</em> Benutzer angemeldet ist. Dies ist z.B. sinnvoll, um Informationen wie "Wie melde ich mich an?" oder ähnliches anzuzeigen, die irrelevant sind, wenn der Benutzer letzlich angemeldet ist.

# filelink_size.description
source: Enable the display of file sizes.
de: Markieren Sie dieses Feld, wenn Sie Dateigrößen angezeigt bekommen möchten.

# header.description
source: Enter header text for the Content Element.
de: Geben Sie eine Überschrift für das Inhaltselement ein.

# header.details
source: Almost all Content Elements will display this header above the content. If you don't want the header displayed, set the header Layout to "Hidden". You can also choose not to enter any content in this field. Some content element types do not display the header by default. In those cases the Header field is typically labeled "Name" instead. One example is the HTML Content Element.
de: Fast alle Elemente (außer z.B. HTML) können eine Überschrift vor dem Inhalt anzeigen. Falls Sie nicht wollen, dass ein Titel angezeigt wird, wählen Sie den Überschriftstyp "verborgen" aus. Alternativ können Sie das Feld auch leer lassen. Einige Inhaltselemente zeigen die Überschrift standardmäßig nicht an. In solchen Fällen wird das Feld "Name" genannt. Einer dieser Typen ist "HTML".

# header_layout.description
source: Select a visual design for the header.
de: Wählen Sie ein Layout für die Überschrift aus.

# header_layout.details
source: If you select "Default" the standard design (which is one of the layouts 1-5) will be used. Alternatively you can select from Layout 1 through 5 which are configured in the website template with individual visual designs. If you select "Hidden" the header will simply not appear. This is useful when you don't need a header to display on the website but still want to identify the Content Element in the Backend.
de: Wenn Sie "Normal" auswählen, wird das Standardlayout (eines der Layouts 1-5) verwendet. Der Standard ist in der Vorlage festgelegt. Alternativ können Sie auch ein Layout ausdrücklich (von 1 bis 5) festlegen, das in der Vorlage der Website individuell konfiguriert ist. Wenn Sie "Verborgen" auswählen, erscheint die Überschrift einfach nicht. Dies ist hilfreich, wenn Sie dem Element einen Namen geben wollen (um es im Backend zu identifizieren), auf der Seite aber keine Überschrift erscheinen soll.

# header_link.description
source: Creates a link from the header to a Page ID, email address, or URL.
de: Macht aus der Überschrift auch einen Link. Geben Sie eine Seitennummer, E-Mail-Adresse oder URL ein.

# header_link.syntax
source: If you insert a Page ID (ex. 51), the link will point to the page with id=51 <em>inside</em> TYPO3. If you insert an email address (ex. name@my-domain.test), the link will point to that email address. If you insert an URL or domain, (ex. www.typo3.org or http://www.my-domain.org), the link will point to that website.
de: Wenn Sie eine ID-Nummer, z.B. "51" eingeben, verlinkt die Überschrift zu der Seite mit der id=51 <em>innerhalb</em> Ihres TYPO3-Web-Auftritts. Wenn Sie eine E-Mail-Adresse, z.B. "name@my-domain.test" eingeben, wird der Link auf diese E-Mail-Adresse zeigen. Wenn Sie eine URL oder Domäne eingeben, z.B. "www.typo3.org" oder "http://www.my-domain.org", wird der Link auf diese externe Website zeigen.

# header_position.description
source: Aligns the header to the left, center, or right.
de: Richtet die Überschrift links, mittig oder rechts aus.

# hidden.description
source: Check this box if you wish to disable the Content Element and keep it from being displayed on the website.
de: Wählen Sie diese Box um das Inhaltselement zu deaktivieren und zu verhindern, dass es auf der Website erscheint.

# imageborder.description
source: Displays a colored border around the images.
de: Wählen Sie diese Option, wenn das Bild einen farbigen Rahmen erhalten soll.

# imagecaption.description
source: Enter captions for the images. For multiple images, enter one caption per line.
de: Geben Sie eine Bildunterschrift ein.

# imagecaption.details
source: By default, the caption is positioned below the images. However, your TypoScript template may be configured to allow individual image captions by setting "styles.content.imgtext.captionSplit=1" in your template constants. In this case, each line in this field will be the image caption of the corresponding image in the list. The caption text field is also used by the Content Element type "File Links" where each line represents a description of a file in the list.
de: Normalerweise wird die Bildunterschrift unter dem gesamten Bilderblock angezeigt. Die Vorlage der Website kann jedoch so programmiert werden, dass sie individuelle Bildunterschriften anzeigt, indem in den Vorlagenkonstanten "styles.content.imgtext.captionSplit=1" gesetzt wird. In diesem Fall entspricht jede Zeile der Bildunterschrift je eines Bildes. Das Feld wird außerdem vom Inhaltstypen "Dateilinks" verwendet, wobei jede Zeile der Beschreibung einer Datei in der Liste entspricht.

# imagecols.description
source: Set the number of columns when the images are displayed in the Frontend of the website.
de: Wählen Sie die Anzahl der Spalten des Bilderblocks aus.

# .image_descr
source: The Page Module is used to manage Content Elements arranged in columns and languages. A Content Element has an editing form with many options. The "Type" determines which options are visible. In the Frontend, a Content Element like the above could look like this.
de: Das Modul "Seite" wird benutzt, um Inhaltselemente effizient zu verwalten: Sie sind in Spalten und Sprachen arrangiert. Ein Inhaltselement wird über ein großes Formular mit vielen Optionen bearbeitet. Der "Typ" bestimmt, welche Optionen sichtbar sind. Im Frontend - der Web-Seite - könnte ein Inhaltselement, wie das oben sichtbare, etwa so aussehen wie hier gezeigt.

# image.description
source: Insert one or more images.
de: Fügt ein oder mehrere Bilder ein.

# image.details
source: You can attach multiple images to the Content Element. Depending on the configuration of TYPO3, you can attach images in many formats without worrying about size and compression. TYPO3's graphics processing handles these details for you. When you use the "Text & Images" type, it's important to select a proper position for images. For this purpose, use the Position and Aligment selector. See link to "Page Content / Position" below. You can also display images in multiple columns and even enable an option that opens full size images when thumbnails are clicked.
de: Sie können dem Element Bilder in fast beliebiger Anzahl hinzufügen. Abhängig von Ihrer TYPO3-Konfiguration können Sie Bilder in fast jedem Format anfügen. Sie müssen sich insbesondere keine Gedanken über Größe oder Kompression machen, da diese Faktoren normalerweise TYPO3-intern gehandhabt werden. Wenn Sie "Text und Bilder" verwenden, ist es wichtig, die richtige Position des Bildblocks auszuwählen. Für diesen Zweck nutzen Sie die Positionsauswahl, die unterhalb des Textfelds gezeigt wird. Siehe Link zu Seiteninhalt>Position unten. Sie können Bilder auch in mehreren Spalten anordnen und eine Option aktivieren, mit der Sie durch Anklicken des kleinen Bildes eine größere Version des Bildes ansehen können. Um nur ein paar Optionen zu nennen. Sehr wahrscheinlich stehen Ihnen gar nicht alle Optionen zur Verfügung. Dies hängt von Ihren Berechtigungen im System ab.

# image_frames.description
source: Select special image framing options.
de: Wählen Sie spezielle Rahmenoptionen aus.

# imageheight.description
source: Enter the height (in pixels) for displaying the images in the Frontend of your website.
de: Geben Sie die Höhe des Bildes (in Pixeln) an.

# image.image_descr
source: This shows all the options related to inserting images in Content Elements. Depending on user permissions, you may not be able to use all of them.
de: Hier sehen Sie alle Optionen, die sich auf das Einfügen von Bildern in Inhaltselementen beziehen. Möglicherweise stehen Ihnen nicht alle Optionen zur Verfügung.

# image_link.description
source: Enter a link for the image. For multiple images, separate the links with commas.
de: Geben Sie einen Link für die Bilder ein.

# image_link.details
source: By default all images share the same link. Your TypoScript template may be configured to allow a separate link for each image. If this is the case, you simply separate the links with a comma. See Page Content>Link below for details on syntax.
de: Standardmäßig haben alle Bilder denselben Link. Sie können aber Ihren Administrator darum bitten, die TYPO3-Vorlage so zu ändern, dass jedes Bild seinen eigenen Link erhält. Wenn dies der Fall ist, trennen Sie die einzelnen Links einfach mit einem Komma. Einzelheiten zur Syntax erhalten Sie unten über Seiteninhalt > Link.

# imageorient.description
source: Select the position and alignment of the images relative to the body text.
de: Wählen Sie die Position des Bilderblocks relativ zum Text.

# imageorient.details
source: The positions above and below the body text are pretty straight forward. The options for "In text" mean that images are displayed with text wrapped around them. When you select this option the template will probably force the images into smaller dimensions to accommodate the width of the template and the width of the text. The bodytext will float <em>under</em> the image block when it reaches the end of the image block. In other words, the body text <em>wraps around</em> the image block. If you select "In text" below the "No wrap" divider, the body text will not float under the image block, but simply continue in its column. Apart from the visual difference there is a technical aspect as well. If you choose to allow the content to wrap the image block you will experience a strange phenomenon when you do not have enough bodytext to make it float around the image: subsequent content elements on the page will appear to be layered on top of the image block. However it's easily solved by changing the "In text" position to the equal value but below the "No wrap" divider.
de: Die Positionen über und unter dem Text sind von sich aus verständlich. Die Optionen "Im Text" bedeuten, dass die Bilder vom Text umflossen werden. Wenn Sie dies auswählen, wir die Vorlage die Bilder wahrscheinlich verkleinern, weil es nicht den gleichen Raum einnehmen kann, wenn Text drum herum fließen soll. Wenn Sie "Im Text" benutzen, können Sie die Optionen oberhalb und unterhalb von "Kein Umbruch" auswählen. Wenn Sie "Im Text" oberhalb auswählen, wird der Text <em>unter</em> dem Bilderblock weiter fließen, sobald der Text das untere Ende des Bilderblocks erreicht hat. Wenn Sie "Im Text" unter dem "Kein Umbruch"-Trenner auswählen, wird der Text nicht unter dem Bild weiter laufen, sondern in seiner Spalte bleiben. Abgesehen vom Aussehen gibt es auch einen technischen Unterschied. Wenn Sie den Text um den Bilderblock herum fließen lassen, werden Sie ein seltsames Phänomen festellen, falls Sie nicht genug Text haben, um unter dem Bild weiter zu laufen: Sie werden feststellen, dass folgende Seiteninhalte über dem Bilderblock dargestellt werden - und dies sieht wie ein Fehler aus. Dies ist einfach zu beheben, indem Sie die entsprechende Position unter dem "Kein Umbruch"-Trenner auswählen.

# imagewidth.description
source: Enter the width (in pixels) for displaying the image in the Frontend of your website.
de: Geben Sie die Breite des Bildes (in Pixeln) an.

# imagewidth.details
source: The TypoScript template is normally configured with maximum image width so you shouldn't need to specify a width. In unique cases, this provides additional flexibility though.
de: Normalerweise ist die Vorlage für eine maximale Bildbreite ausgelegt und daher müssen Sie die Breite nicht angeben, wenn das Bild perfekt in diese Abmessungen passt. Trotzdem haben Sie hier die Gelegenheit, die Breite ausdrücklich zu definieren.

# image_zoom.description
source: When enabled, clicking an image will open a larger version in a popup window.
de: Markieren Sie diese Option und das Bild wird auf ein neues Fenster mit einer größeren Ansicht verlinkt.

# image_zoom.details
source: This option overrides the value in the Links field.
de: Diese Option überschreibt den Wert des Link-Feldes.

# layout.description
source: Select a Layout.
de: Wählen Sie ein Layout.
