Repository: bertelsmannstift/Chancenportal
Catalog: web/typo3conf/l10n/*/context_help/Resources/Private/Language/*.locallang_csh_ttcontent.xlf
Languages: de

# layout.details
source: This option does not work by default for all Content Elements but your website may display Content Elements differently depending on the layout. The File Links Content Element does make use of the Layout field by default: "Normal" will provide a list of file links with no thumbnail. "Layout 1" adds a file icon to the left of the link "Layout 2" adds a thumbnail for image files and an icon for other files. A black border is wrapped around the icon. "Layout 3" is similar to Layout 2, but without the black border.
de: Diese Option wird von den Standardvorlagen nicht verwendet und kann für benutzerdefinierte Ansichten verwendet werden. Es gibt einige Standardimplementierungen, die vom Inhaltstyp abhängig sind: <b>"Dateilinks":</b> "Normal" erzeugt eine Liste ohne Vorschau-Symbole. "Layout 1" fügt ein Dateisymbol links vom Link ein. "Layout 2" Fügt ein Vorschausymbol ein, falls die Datei ein Bild ist. Ein schwarzer Rahmen wird hinzugefügt. "Layout 3" ist wie Layout 2, aber ohne schwarzen Rahmen.

# linkToTop.description
source: If checked, a small "To Top" link will be added after the Content Element, linking back to the top of the page.
de: Falls markiert, erscheint ein kleiner "Nach oben"-Link nach dem Inhaltselement.

# list_type.description
source: Select a plugin to insert.
de: Wählen Sie das einzufügende Plug-In aus. (Verfügbarkeit hängt von der Vorlage ab).

# list_type.details
source: The list of plugins you can insert on a page. The available plugins depend on which extensions are installed.
de: Die Liste der Plug-Ins, die Sie auf der Seite einfügen können. Die verfügbaren Plug-Ins hängen davon ab, welche Erweiterungen installiert sind.

# media.description
source: Files can be added to the list here.
de: Fügen Sie der Liste Dateien hinzu.

# menu_type.description
source: Select the type of menu you wish to create.
de: Wählen Sie, welche Art von Menü Sie erstellen wollen.

# menu_type.details
source: This is a short description of each type: <strong>Menu of selected pages</strong> This will create a menu with links to the pages in the Selected Pages list. <strong>Menu of subpages of selected pages</strong> This will create in a menu with links to the subpages of the pages in the Selected Pages list. If you do not specify any pages, the subpages to the current page will be used. <strong>Menu of subpages of selected pages (with abstract)</strong> Like the previous option, but also displays the content of the Abstract field (or the Description field) for each page in the menu. The Abstract field is given priority over the Description field if both are complete. <strong>Menu of subpages of selected pages + sections</strong> Like the previous option, but includes links to all Content Elements on the page that are marked to Show In Section Menus. <strong>Sitemap</strong> Generates a classic tree sitemap. Notice that the sitemap will begin from the current page unless you select another page instead. <strong>Section index (page content marked for section menus)</strong> This makes a menu of Content Elements on the selected pages for all Content Elements marked to Show In Section Menu. This is a great way to make an index at the top of the page. If you don't want certain Content Elements to appear in the list, just uncheck the Show in Section Menus checkbox for those elements. <strong>Recently updated pages</strong> This displays the 10 most recently updated pages. <strong>Notice:</strong> If you update a page and the updated page is not included in this list, clearing the Page Cache will resolve the issue. <strong>Related pages (based on keywords)</strong> Displays other related pages based on the keywords of the selected pages matched against the keywords of other pages.
de: Dies ist eine kurze Beschreibung jedes Typs: <strong>Menü dieser Seiten</strong> Dies erzeugt eine Liste von Links auf die in "Ausgangspunkt" angegebenen Seiten. <strong>Menü der Unterseiten</strong> Dies erzeugt eine Liste von Links auf die in "Ausgangspunkt" angegebenen Seiten und deren Unterseiten. Wenn Sie keine Startseite(n) angeben, werden die Unterseiten der aktuellen Seite aufgelistet. <strong>Menü der Unterseiten (mit Inhaltsangabe)</strong> Wie das Vorherige. Aber dieses enthält den Inhalt des Feldes "Inhaltsangabe" jeder Seite. <strong>Menü der Unterseiten (mit Seiteninhalt)</strong> Wie das Vorherige, inklusive 'Untermenü'-Links auf alle Seiteninhalte der Seite deren Index-Feld markiert ist. <strong>Sitemap</strong> Erzeugt einen klassischen Sitemap-Baum. Vielleicht definiert Ihre Vorlage eine andere Ansicht, aber Sie bekommen eine Sitemap. Beachten Sie, dass die Sitemap auf der aktuellen Seite beginnt, es sei denn, Sie definieren einen davon abweichenden "Ausgangspunkt". <strong>Abschnittsübersicht (mit Seiteninhalt)</strong> Dies erzeugt ein Menü der Seiteninhalte dieser (oder der in "Ausgangspunkt" ausgewählten) Seite. Gut geeignet, um einen Index am Anfang umfangreicher Seiten zu erstellen. Beachten Sie, dass alle Elemente angezeigt werden, deren Index-Feld markiert ist. Falls Sie einige Elemente in der Liste nicht angezeigt bekommen möchten, so deaktivieren Sie das Index-Feld für diese Elemente. <strong>Geänderte Seiten</strong> Zeigt die 10 zuletzt geänderten Seiten an. <strong>Hinweis:</strong> Wenn Sie eine Seite ändern und die Liste sich nicht ändert, löschen Sie einfach den Cache dieser Seite und das Problem ist behoben. <strong>Verwandte Seiten (nach Stichworten)</strong> Zeigt verwandte Seiten basierend auf den Stichworten dieser Seite verglichen mit den Stichworten anderer Seiten an. Hinweis: Für viele der beschriebenen Menütypen ist der Startpunkt die aktuelle Seite. Davon abweichend können Sie jede andere Seite (oder sogar mehrere) als Startpunkt festlegen, indem Sie sie in die Liste "Ausgangspunkt" aufnehmen. Siehe Link unten.

# multimedia.description
source: Insert a multimedia element here (ex. Flash movie)
de: Fügen Sie hier das Multimediaelement ein, z.B. eine Flash-Animation.

# pages.description
source: Select a target page or multiple target pages.
de: Seite(n) einfügen

# pages.details
source: This field is used by many of the Content Element types to create a relation to either a single target page or multiple target pages. If no target page is specified, the current page will generally be used. Using the "Search" Content Element, the target page is where search results will appear. You must make sure that this page has a similar "Search" Content Element to display the results. The "Login" Content Element (not to be confused with the Login plugin available when the felogin extension is installed) also uses this field to redirect the login to a certain page. That page does not need to contain a "Login" Content Element in order to perform the authentication since any TYPO3 page can handle a login request. If you specify a second page in this list, the ID will be passed to the login system as the page inside TYPO3 where website users are found. You should use this only if your template is not already configured to pass this value on. In order for the login procedure to work you must make sure that you have created website users and website usergroups, have specified where these website users can be found (typically a SysFolder), a page ID in the page list, and ensured that cookies are enabled for the site. The "Menu/Sitemap" Content Elements also use this field. In this case the page will determine the starting point for the menu or the actual pages shown in the menu. This behavior depends on the menu type you have selected. Finally the "Form" element uses this field as the target page to which the form is submitted. A common use is the "Thank you" page after the form is completed.
de: Mit diesem Feld können Sie eine Beziehung zu einer Seite (oder mehreren) in TYPO3 herstellen. Dieses Feld wird von mehreren Inhaltstypen verwendet. Wenn Sie hier keine Seite angeben, wird grundsätzlich die aktuelle Seite verwendet. Für den Typ "<b>Suche</b>" beinhaltet das Feld die Seite, auf der das Suchergebnis angezeigt wird. Sie müssen sicherstellen, dass das Ziel ein solches "Suche"-Element (oder etwas ähnliches) besitzt, um das Ergebnis darzustellen. Ansonsten ist es nicht sinnvoll. Das Element "<b>Anmeldeformular</b>" benutzt dies Feld ebenfalls, um den angemeldeten Benutzer auf eine neue Seite zu umzuleiten. Dieses Ziel benötigt allerdings kein Anmeldeformularelement, um die Anmeldung durchzuführen - Sie können den Anwender auf jede beliebige TYPO3-Seite weiterleiten! Wenn Sie in der Liste eine zweiter Seite angeben, so wird diese Seite an das Anmeldesystem als diejenige Seite weitergeleitet, wo die Datenbank der Anwender zu finden ist. Sie sollten dies nur verwenden, wenn Ihre Vorlage diesen Wert nicht von sich aus weiterleitet. Damit die Anmeldung funktioniert, müssen Sie sicherstellen, dass 1) Sie einen Benutzer und eine Benutzergruppe erstellt haben, 2) Sie in der Vorlage definiert haben, auf welcher Seite (typisch ein SysOrdner) die Benutzer gefunden werden können - oder sie haben dies durch die zweite Seite in der Seitenliste getan, 3) Cookies im Browser des Anwenders aktiviert sind. Der Inhaltstyp "<b>Menü/Sitemap</b>" benutzt dieses Feld ebenfalls. In diesem Fall wird damit spezifiziert, von welcher Seite aus das Menü erzeugt wird oder enthält sogar diejenigen Seiten, auf die das Menü verweist. All dies hängt vom ausgewählten Untertyp ab. Schließlich benutzt das Element "<b>Formular</b>" dieses Feld als Angabe, welche Seite nach Absenden des Formulars angezeigt wird. Sie können auf diese Art eine "Vielen Dank"-Seite für das Mail-Formular erstellen.

# pi_flexform.description
source: Plugin Configuration
de: FlexForm-Konfiguration von Plug-Ins

# pi_flexform.details
source: Some plugins may provide configuration options, but the actual options vary based on the plugin. Behind the scenes, these are based on FlexForms and stored as XML.
de: Manche Plug-Ins erfordern eine Konfiguration ihrer Optionen. Sie können dies Feld für FlexForm-basierte Konfigurationseinstellungen (als XML gespeichert) benutzen.

# records.description
source: Insert records to be displayed on this page.
de: Fügen Sie Verweise auf Datensätze ein.

# recursive.description
source: The number of subpage levels that should also be included for each page in the list.
de: Entscheiden Sie, wie viele Unterebenen für jeder der ausgewählten Seiten zusätzlich ausgewählt werden sollen.

# recursive.details
source: This feature depends on the TypoScript template configuration and Content Element type. If enabled, each page listed in the "Pages" field will also have its subpages included to the specified depth. <strong>Warning:</strong> If there are many subpages, be aware that this option may return a large number of results
de: Ob diese Funktion sinnvoll ist, entscheidet die Vorlage und/oder der Inhaltstyp. Aber grundsätzlich bedeutet die Aktivierung dieser Option, dass alle Unterseiten der ausgewählten Seiten in "Ausgangspunkt" bis zur gewählten Tiefe ebenfalls ausgewählt werden! <strong>Warnung:</strong> Falls es viele Unterseiten gibt, sollten sie mit dieser Option vorsichtig umgehen. Sie könnten eine unglaubliche Anzahl an Seiten auswählen!

# rte_enabled.description
source: If checked, the Rich Text Editor will be disabled for the "Text" and "Text & Image" types (<em>in this Content Element only</em>).
de: Der Rich-Text-Editor wird für dieses Element deaktivert, falls diese Option markiert ist (<em>nur für dieses Element</em>).

# sectionIndex.description
source: If set, the Content Element will appear in Section Menus.
de: Falls markiert, taucht der Seiteninhalt in Menüs auf.

# sectionIndex.details
source: See more details about Section Menus by clicking below.
de: Siehe Details zum Menütyp (unten klicken).

# _.seeAlso
source: Page Content Principles | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout
de: Grundsätze zu Seiteninhalten | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout

# spaceAfter.description
source: Bottom Margin (in pixels) inserts whitespace <em>after</em> this Content Element.
de: Geben Sie den Abstand (in Pixeln) ein, der nach diesem Inhalt eingefügt werden soll.

# spaceBefore.description
source: Top Margin (in pixels) inserts whitespace <em>before</em> this Content Element.
de: Geben Sie den Abstand (in Pixeln) ein, der vor diesem Inhalt eingefügt werden soll.

# starttime.description
source: Enter the date when the Content Element should be published and displayed on the website.
de: Geben Sie das Datum ein, ab dem das Inhaltselement veröffentlicht und auf der Website angezeigt werden soll.

# subheader.description
source: Enter a subheader to be displayed below the main header. If the Content Element is a "Form" this field is instead used as the Recipient Email.
de: Geben Sie einen Untertitel ein. Dieser wird unterhalb der Überschrift angezeigt. Falls es sich um den Inhaltstyp "Formular" handelt, ist hier die E-Mail-Adresse des Empfängers einzutragen.

# subheader.details
source: A subheader is displayed only with "Header" Content Elements and with "Form" Content Elements (as the Recipient Email).
de: Ein Untertitel wird nur für den Inhaltstyp "Überschrift" angezeigt. <b>Hinweis:</b> Wenn Inhalte des Typs "Formular" eingesetzt werden, wird dieses Feld "E-Mail-Empfänger:" benannt und enthält die E-Mail-Adresse des Formularempfängers. Daher ist es wichtig, dass die Anwender Zugriff auf dieses Feld bekommen.

# sys_language_uid.description
source: Select the system language of this Content Element. <strong>Notice:</strong> This will affect the Content Element visibility by limiting it to a certain language.
de: Wählen Sie die Systemsprache für dieses Inhaltselement aus. <strong>Hinweis:</strong> Das hat Einfluss auf die Sichtbarkeit des Inhaltselements, indem es sie auf die entsprechende Sprache beschränkt.

# sys_language_uid.details
source: This allows you to assign a specific language to the Content Element. If you select anything but the default value, the element will <em>not</em> be visible unless the language assigned is also configured by the TypoScript template. The available system languages are created by the administrator.
de: Dies erlaubt es Ihnen, dem Element eine spezifische Sprache zuzuordnen. Falls Sie etwas anderes als die Standardsprache auswählen, wird das Element <em>nicht</em> sichtbar sein, solange diese Sprache nicht in der Vorlage konfiguriert wurde. Die verfügbaren Systemsprachen werden vom Administrator eingestellt.

# _sys_language_uid.seeAlso
source: tt_content:colPos, sys_language, Localization concepts [Technical] | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/, _MOD_web_layout:language_list
de: tt_content:colPos, sys_language, Lokalisierungskonzepte [Technisch] | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/, _MOD_web_layout:language_list
