Repository: bertelsmannstift/Chancenportal
Catalog: web/typo3conf/l10n/*/core/Resources/Private/Language/*.fileMessages.xlf
Languages: de

source: Cannot copy folder "%s" into target folder "%s", because the target folder is already within the folder to be copied!
de: Ordner "%s" kann nicht in Zielordner "%s" kopiert werden, weil der Zielordner sich bereits in dem zu kopierenden Ordner befindet!

source: Cannot move folder "%s" into target folder "%s", because the target folder is already within the folder to be moved!
de: Ordner "%s" kann nicht in Zielordner "%s" verschoben werden, weil der Zielordner sich bereits in dem zu verschiebenden Ordner befindet!

# FileUtility.CouldNotAccessAllNecessaryResources
source: Could not access all necessary resources. Source file or destination maybe was not within your mountpoints? T="%s", D="%s"
de: Kein Zugriff auf alle notwendigen Ressourcen. Liegen Quell- und Zieldatei innerhalb Ihrer Freigabepunkte? Z="%s", Q="%s"

# FileUtility.CouldNotDeleteDirectory
source: Could not delete directory! Is directory "%s" empty? (You are not allowed to delete directories recursively).
de: Verzeichnis konnte nicht gelöscht werden! Ist das Verzeichnis "%s" leer? (Sie haben keine Berechtigung, Verzeichnisse rekursiv zu löschen.)

# FileUtility.CouldNotDeleteDirectory1
source: Could not delete directory "%s"! There might be a problem with write permissions.
de: Verzeichnis "%s" konnte nicht gelöscht werden! Möglicherweise gibt es ein Problem mit den Schreibberechtigungen.

# FileUtility.CouldNotDeleteFile
source: Could not delete file "%s". There might be a problem with write permissions.
de: Datei "%s" konnte nicht gelöscht werden. Möglicherweise gibt es ein Problem mit den Schreibberechtigungen.

# FileUtility.DestinationExistedAlready
source: Destination "%s" already exists!
de: Ziel "%s" existiert bereits!

# FileUtility.DestinationPathWasNotWithinYourMountpoints
source: Destination path "%s" was not within your mountpoints!
de: Zielpfad "%s" liegt nicht innerhalb Ihrer Freigabepunkte!

# FileUtility.DestinationWasNotADirectory
source: Destination "%s" was not a directory.
de: Ziel "%s" war kein Verzeichnis.

# FileUtility.DirectoryCopiedTo
source: Directory "%s" copied to "%s".
de: Verzeichnis "%s" wurde nach "%s" kopiert.

# FileUtility.DirectoryCreatedIn
source: Directory "%s" created in "%s".
de: Verzeichnis "%s" wurde in "%s" erstellt.

# FileUtility.DirectoryMovedTo
source: Directory "%s" moved to "%s".
de: Verzeichnis "%s" wurde nach "%s" verschoben.

# FileUtility.DirectoryNotCreated
source: Directory "%s" not created. There might be a problem with write permissions in "%s"?
de: Verzeichnis "%s" wurde nicht erstellt. Möglicherweise gibt es ein Problem mit den Schreibberechtigungen in "%s".

# FileUtility.DirectoryRenamedFromTo
source: Directory renamed from "%s" to "%s".
de: Verzeichnis wurde von "%s" nach "%s" umbenannt.

# FileUtility.DirectoryRenamedSameName
source: Directory "%s" was not renamed. (Same name as before)
de: Verzeichnis "%s" wurde nicht umbenannt. (Selber Name wie zuvor.)

# FileUtility.DirectoryWasNotCopiedTo
source: Directory "%s" WAS NOT copied to "%s"! There might be a problem with write permissions
de: Verzeichnis "%s" wurde NICHT nach "%s" kopiert! Möglicherweise gibt es ein Problem mit den Schreibberechtigungen.

# FileUtility.DirectoryWasNotMovedTo
source: Directory "%s" WAS NOT moved to "%s"! There might be a problem with write permissions
de: Verzeichnis "%s" wurde NICHT nach "%s" verschoben! Möglicherweise gibt es ein Problem mit den Schreibberechtigungen.

# FileUtility.DirectoryWasNotRenamed
source: Directory "%s" was not renamed! There might be a problem with write permissions in "%s"?
de: Verzeichnis "%s" wurde nicht umbenannt! Möglicherweise gibt es ein Problem mit den Schreibberechtigungen in "%s".

# FileUtility.ExtensionOfFileNameIsNotAllowedIn
source: Extension of file name "%s" is not allowed in "%s"!
de: Erweiterung von Datei "%s" in "%s" ist nicht erlaubt!

# FileUtility.ExtensionOfFileNameOrWasNotAllowed
source: Extension of file name "%s" or "%s" was not allowed!
de: Erweiterung von Datei "%s" oder "%s" ist nicht erlaubt!

# FileUtility.ExtensionOfFileWasNotAllowed
source: Extension of file "%s" was not allowed!
de: Erweiterung von Datei "%s" ist nicht erlaubt!

# FileUtility.FileAlreadyExistsInFolder
source: File "%s" already exists in folder "%s"!
de: Datei "%s" in Ordner "%s" existiert bereits!

# FileUtility.FileCopiedTo
source: File "%s" copied to "%s".
de: Datei "%s" wurde nach "%s" kopiert.

# FileUtility.FileCreated
source: File created: "%s".
de: Datei erstellt: "%s".

# FileUtility.FileExistedAlreadyIn
source: File existed already in "%s"!
de: Datei existiert bereits in "%s"!

# FileUtility.FileExtensionIsNotATextfileFormat
source: File extension "%s" is not a textfile format! (%s).
de: Dateierweiterung "%s" gehört nicht zu einem Textdateiformat! (%s)

# FileUtility.FileExtensionIsNotzip
source: File extension is not "zip".
de: Dateierweiterung ist nicht "zip".

# FileUtility.FileMovedTo
source: File "%s" moved to "%s".
de: Datei "%s" wurde nach "%s" verschoben.

# FileUtility.FileNameWasNotAllowed
source: File name "%s" was not allowed!
de: Dateiname "%s" ist nicht erlaubt!

# FileUtility.FileOrDestinationWasNotWithinYourMountpoints
source: File "%s" or destination "%s" was not within your mountpoints!
de: Datei "%s" oder Ziel "%s" liegt nicht innerhalb Ihrer Freigabepunkte!

# FileUtility.FileOrDirectoryExistedAlready
source: File or directory "%s" already exists!
de: Datei oder Verzeichnis "%s" existiert bereits!

# FileUtility.FileRenamedFromTo
source: File renamed from "%s" to "%s".
de: Datei wurde von "%s" nach "%s" umbenannt.

# FileUtility.FileRenamedSameName
source: File "%s" was not renamed. (Same name as before)
de: Datei "%s" wurde nicht umbenannt. (Selber Name wie zuvor.)

# FileUtility.FileSavedToBytesMd5
source: File saved to "%s", bytes: %s, MD5: %s.
de: Datei gespeichert unter "%s", Bytes: %s, MD5: %s.

# FileUtility.FileWasNotCopiedTo
source: File "%s" WAS NOT copied to "%s"! There might be a problem with write permissions.
de: Datei "%s" wurde NICHT nach "%s" kopiert! Möglicherweise gibt es ein Problem mit den Schreibberechtigungen.

# FileUtility.FileWasNotCreated
source: File "%s" was not created! There might be a problem with write permissions in "%s"?
de: Datei "%s" wurde nicht erstellt! Möglicherweise gibt es ein Problem mit den Schreibberechtigungen in "%s".

# FileUtility.FileWasNotRenamed
source: File "%s" was not renamed! There might be a problem with write permissions in "%s"?
de: Datei "%s" wurde nicht umbenannt! Möglicherweise gibt es ein Problem mit den Schreibberechtigungen in "%s".

# FileUtility.FileWasNotSaved
source: File "%s" was not saved! There might be a problem with write permissions.
de: Datei "%s" wurde nicht gespeichert! Möglicherweise gibt es ein Problem mit den Schreibberechtigungen.

# FileUtility.FileWasNotSaved2
source: File "%s" was not saved! File extension rejected!
de: Datei "%s" wurde nicht gespeichert! Dateierweiterung zurückgewiesen!

# FileUtility.InvalidFolderName
source: Invalid folder name "%s"!
de: Der Ordnername "%s" ist ungültig!

# FileUtility.NoFileWasUploaded
source: No file was uploaded!
de: Es wurde keine Datei hochgeladen!

# FileUtility.NoFileWasUploadedForReplacing
source: No file was uploaded for replacing!
de: Es wurde keine Datei zum Ersetzen hochgeladen!

# FileUtility.NoNameForNewFolderGiven
source: No name for new folder given!
de: Es wurde kein Name für den neuen Ordner angegeben!

# FileUtility.NoUniqueFilenameAvailableIn
source: No unique filename available in "%s"!
de: In "%s" ist kein eindeutiger Dateiname verfügbar!

# FileUtility.ReplacingFileTo
source: Replacing file "%s" to "%s".
de: Datei "%s" wird durch "%s" ersetzt.

# FileUtility.TargetAlreadyExists
source: Target "%s" already exists!
de: Ziel "%s" existiert bereits!

# FileUtility.TargetWasNotAFile
source: Target "%s" was not a file!
de: Ziel "%s" ist keine Datei!

# FileUtility.TargetWasNotWithinYourMountpoints
source: Target was not within your mountpoints! T="%s".
de: Ziel liegt nicht innerhalb Ihrer Freigabepunkte! Z="%s".

# FileUtility.TheFileDidNotExist
source: The file "%s" did not exist!
de: Datei "%s" war nicht vorhanden!

# FileUtility.TheFunctionToCopyAFileBetweenStoragesIsNotYetImplemented
source: The function to copy a file between storages is not yet implemented.
de: Die Funktion, eine Datei zwischen Speichern zu kopieren, ist noch nicht implementiert.

# FileUtility.TheFunctionToCopyAFolderBetweenStoragesIsNotYetImplemented
source: The function to copy a folder between storages is not yet implemented.
de: Die Funktion, einen Ordner zwischen Speichern zu kopieren, ist noch nicht implementiert.

# FileUtility.TheFunctionToMoveAFileBetweenStoragesIsNotYetImplemented
source: The function to move a file between storages is not yet implemented.
de: Die Funktion, eine Datei zwischen Speichern zu verschieben, ist noch nicht implementiert.

# FileUtility.TheFunctionToMoveAFolderBetweenStoragesIsNotYetImplemented
source: The function to move a folder between storages is not yet implemented.
de: Die Funktion, einen Ordner zwischen Speichern zu verschieben, ist noch nicht implementiert.

# FileUtility.TheUploadedFileExceedsTheSize-limit
source: The uploaded file "%s" exceeds the size-limit
de: Die hochgeladene Datei "%s" überschreitet de Größenbeschränkung.

# FileUtility.TheUploadHasFailedNoUploadedFileFound
source: The upload has failed, no uploaded file found!
de: Das Hochladen ist fehlgeschlagen; es wurde keine hochgeladene Datei gefunden!

# FileUtility.UnzippingFileIn
source: Unzipping file "%s" in "%s".
de: Entpacken der Datei "%s" in "%s".

# FileUtility.UploadedFileCouldNotBeMoved
source: Uploaded file could not be moved! There might be a problem with write permissions in "%s"?
de: Die hochgeladene Datei konnte nicht verschoben werden! Möglicherweise gibt es ein Problem mit den Schreibberechtigungen in "%s".

# FileUtility.UploadingFileTo
source: Uploading file "%s" to "%s".
de: Hochladen der Datei "%s" nach "%s".

# FileUtility.YouAreNotAllowedToAccessTheDirectory
source: You are not allowed to access the directory.
de: Sie haben keine Berechtigung, auf dieses Verzeichnis zuzugreifen.

# FileUtility.YouAreNotAllowedToAccessTheFile
source: You are not allowed to access the file.
de: Sie haben keine Berechtigung, auf diese Datei zuzugreifen.

# FileUtility.YouAreNotAllowedToCopyDirectories
source: You are not allowed to copy directories.
de: Sie haben keine Berechtigung, Verzeichnisse zu kopieren.

# FileUtility.YouAreNotAllowedToCopyFiles
source: You are not allowed to copy files.
de: Sie haben keine Berechtigung, Dateien zu kopieren.

# FileUtility.YouAreNotAllowedToCreateDirectories
source: You are not allowed to create directories!
de: Sie haben keine Berechtigung, Verzeichnisse zu erstellen!

# FileUtility.YouAreNotAllowedToCreateFiles
source: You are not allowed to create files!
de: Sie haben keine Berechtigung, Dateien zu erstellen!

# FileUtility.YouAreNotAllowedToEditFiles
source: You are not allowed to edit files!
de: Sie haben keine Berechtigung, Dateien zu bearbeiten!

# FileUtility.YouAreNotAllowedToMoveDirectories
source: You are not allowed to move directories.
de: Sie haben keine Berechtigung, Verzeichnisse zu verschieben.

# FileUtility.YouAreNotAllowedToMoveFiles
source: You are not allowed to move files.
de: Sie haben keine Berechtigung, Dateien zu verschieben.

# FileUtility.YouAreNotAllowedToOverride
source: You are not allowed to override "%s"!
de: Sie haben keine Berechtigung, "%s" zu überschreiben!

# FileUtility.YouAreNotAllowedToRenameDirectories
source: You are not allowed to rename directories!
de: Sie haben keine Berechtigung, Verzeichnisse umzubenennen!

# FileUtility.YouAreNotAllowedToRenameFiles
source: You are not allowed to rename files!
de: Sie haben keine Berechtigung, Dateien umzubenennen!

# FileUtility.YouAreNotAllowedToUnzipFiles
source: You are not allowed to unzip files.
de: Sie haben keine Berechtigung, Dateien zu entpacken.

# FileUtility.YouAreNotAllowedToUploadFiles
source: You are not allowed to upload files!
de: Sie haben keine Berechtigung, Dateien hochzuladen!

# FileUtility.YouDontHaveFullAccessToTheDestinationDirectory
source: You don't have full access to the destination directory "%s"!
de: Sie haben keinen vollen Zugriff auf das Zielverzeichnis "%s"!
